src/cf/Documents/CRM_УстановкаИспользуемыхПоказателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Document>
		<Properties>
			<Name>CRM_УстановкаИспользуемыхПоказателей</Name>
			<Comment>Соглашение об используемых показателях планирования</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.CRM_ИспользуемыеКлючевыеПоказатели</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесПоказателя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПоказателя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПоказателяМаксимум</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериодаПланирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериодаПланирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Ответственный</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ШаблоныКлючевыхПоказателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_СтатусыУстановкиИспользуемыхПоказателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаБонуса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПериода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеПериодаПланирования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИспользуемыеПоказатели</Name>
					<Comment>Используемые показатели планирования</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Comment>Показатель планирования</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.CRM_ШаблоныКлючевыхПоказателей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Менеджер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПоказателя</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Согласовано</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБонуса</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВесПоказателя</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПоказателяМаксимум</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Менеджеры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Менеджер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/InformationRegisters/CRM_ИспользуемыеКлючевыеПоказатели.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>CRM_ИспользуемыеКлючевыеПоказатели</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеПоказателя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБонуса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВесПоказателя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПоказателяМаксимум</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Показатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ШаблоныКлючевыхПоказателей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Согласовано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/CRM_СтатусыУстановкиИспользуемыхПоказателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Enum>
		<Properties>
			<Name>CRM_СтатусыУстановкиИспользуемыхПоказателей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запланирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подготовлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаСогласовании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СогласованСРуководителем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СогласованСИсполнителями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Действует</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтмененРуководителем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/Периодичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Enum>
		<Properties>
			<Name>Периодичность</Name>
			<Comment>Не переносить в объединенные решения</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/CRM_УстановкаИспользуемыхПоказателей/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		Объект.СтатусДокумента = Перечисления.CRM_СтатусыУстановкиИспользуемыхПоказателей.Действует;
		Если Параметры.Свойство("ПериодПланирования") Тогда
			Объект.НачалоПериодаПланирования = Параметры.ПериодПланирования.ДатаНачала;
			Объект.КонецПериодаПланирования = Параметры.ПериодПланирования.ДатаОкончания;
			Если Месяц(Объект.НачалоПериодаПланирования) = Месяц(Объект.КонецПериодаПланирования) Тогда
				Объект.ВидПериода = Перечисления.Периодичность.Месяц;
			ИначеЕсли Месяц(Объект.НачалоПериодаПланирования) - Месяц(Объект.КонецПериодаПланирования) = 2 Тогда
				Объект.ВидПериода = Перечисления.Периодичность.Квартал;
			Иначе
				Объект.ВидПериода = Перечисления.Периодичность.Год;
			КонецЕсли;
		Иначе	
			Объект.НачалоПериодаПланирования = НачалоМесяца(CRM_ОбщегоНазначенияСервер.ПолучитьТекущуюДатуСеанса());
			Объект.КонецПериодаПланирования = КонецМесяца(CRM_ОбщегоНазначенияСервер.ПолучитьТекущуюДатуСеанса());
			Объект.ВидПериода = Перечисления.Периодичность.Месяц;
		КонецЕсли;
		Объект.Автор = Пользователи.ТекущийПользователь();
	КонецЕсли;	
	Если Параметры.Свойство("Исполнитель") Тогда
		Объект.Исполнитель = Параметры.Исполнитель;
	КонецЕсли;
	Если Параметры.Свойство("Показатель") Тогда
		Объект.Показатель = Параметры.Показатель;
	КонецЕсли;
	Если Объект.Показатель.ЦелевойТренд = "Интервал" Тогда
		Элементы.ЗначениеПоказателяМаксимум.Видимость = Истина;
	КонецЕсли;
	Попытка
		Объект.ПредставлениеПериодаПланирования = ПредставлениеПериода(Объект.НачалоПериодаПланирования, КонецДня(Объект.КонецПериодаПланирования), "L = ru_RU");
	Исключение
	КонецПопытки;
	
	CRM_СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	Если Объект.СтатусДокумента = Перечисления.CRM_СтатусыУстановкиИспользуемыхПоказателей.Действует Тогда
		Элементы.ДатаНазад.Доступность = Ложь;
		Элементы.ДатаВперед.Доступность = Ложь;
		Элементы.ВыборПериода.Доступность = Ложь;
	КонецЕсли;	
	Если НЕ РольДоступна("ПолныеПрава") И Объект.Исполнитель = Пользователи.ТекущийПользователь() Тогда
		Элементы.ДатаНазад.Доступность = Ложь;
		Элементы.ДатаВперед.Доступность = Ложь;
		Элементы.ВыборПериода.Доступность = Ложь;
		Элементы.ЗначениеПоказателя.Доступность = Ложь;
		Элементы.Дата.Доступность = Ложь;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьЗаголовокФормы();
	ДоступностьПериодаДляУстановкиПоказателя();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеВидимостью(Менеджер = Неопределено)
КонецПроцедуры	

&НаКлиенте
Процедура УстановитьЗаголовокФормы()
	Заголовок = НСтр("ru = 'Установка показателя'")+": " + Объект.Показатель + "/" + Объект.Исполнитель + "/" + Объект.СтатусДокумента;
	
	Если CRM_ОбщегоНазначенияСервер.ПолучитьЗначениеРеквизита(Объект.Показатель, "ЦелевойТренд") = "Интервал" Тогда
		Элементы.ЗначениеПоказателяМаксимум.Видимость = Истина;
		Элементы.ЗначениеПоказателя.Заголовок = Элементы.ЗначениеПоказателя.Заголовок + НСтр("ru = ' от'");
		Элементы.ТрендПоказателя.Видимость = Ложь;
	КонецЕсли;
	Если CRM_ОбщегоНазначенияСервер.ПолучитьЗначениеРеквизита(Объект.Показатель, "КратностьЗначений") = "НеИзменять" Тогда
		ЕдиницаИзмерения = CRM_ОбщегоНазначенияСервер.ПолучитьЗначениеРеквизита(Объект.Показатель, "ЕдиницаИзмерения");
	ИначеЕсли CRM_ОбщегоНазначенияСервер.ПолучитьЗначениеРеквизита(Объект.Показатель, "КратностьЗначений") = "Тысячи" Тогда
		ЕдиницаИзмерения = "тыс. "+ CRM_ОбщегоНазначенияСервер.ПолучитьЗначениеРеквизита(Объект.Показатель, "ЕдиницаИзмерения");
	ИначеЕсли CRM_ОбщегоНазначенияСервер.ПолучитьЗначениеРеквизита(Объект.Показатель, "КратностьЗначений") = "Миллионы" Тогда
		ЕдиницаИзмерения = "млн. "+ CRM_ОбщегоНазначенияСервер.ПолучитьЗначениеРеквизита(Объект.Показатель, "ЕдиницаИзмерения");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура ДатаВперед(Команда)
	
	Если Объект.ВидПериода = ПредопределенноеЗначение("Перечисление.Периодичность.Год") Тогда
		Месяцев = 12;
	ИначеЕсли Объект.ВидПериода = ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") Тогда
		Месяцев = 3;
	Иначе
		Месяцев = 1;
	КонецЕсли;
	Объект.НачалоПериодаПланирования = ДобавитьМесяц(Объект.НачалоПериодаПланирования, Месяцев);
	Объект.КонецПериодаПланирования = КонецМесяца(ДобавитьМесяц(Объект.КонецПериодаПланирования, Месяцев));
	Объект.ПредставлениеПериодаПланирования = ПредставлениеПериода(Объект.НачалоПериодаПланирования, КонецДня(Объект.КонецПериодаПланирования), "L = ru_RU");
	ДоступностьПериодадляУстановкиПоказателя();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаНазад(Команда)
	
	Если Объект.ВидПериода = ПредопределенноеЗначение("Перечисление.Периодичность.Год") Тогда
		Месяцев = 12;
	ИначеЕсли Объект.ВидПериода = ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") Тогда
		Месяцев = 3;
	Иначе
		Месяцев = 1;
	КонецЕсли;
	Объект.НачалоПериодаПланирования = ДобавитьМесяц(Объект.НачалоПериодаПланирования, -Месяцев);
	Объект.КонецПериодаПланирования = КонецМесяца(ДобавитьМесяц(Объект.КонецПериодаПланирования, -Месяцев));
	Объект.ПредставлениеПериодаПланирования = ПредставлениеПериода(Объект.НачалоПериодаПланирования, КонецДня(Объект.КонецПериодаПланирования), "L = ru_RU");
	ДоступностьПериодадляУстановкиПоказателя();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборПериода(Команда)
	ПараметрВыбора = Новый Структура("НачалоПериода,КонецПериода", Объект.НачалоПериодаПланирования, Объект.КонецПериодаПланирования);
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборПериодаЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.CRM_ВыборСтандартногоПериода", ПараметрВыбора, Элементы.ВыборПериода, , , , ОписаниеОповещения);
КонецПроцедуры

&НаКлиенте
Процедура ВыборПериодаЗавершение(РезультатВыбора, ДопПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.НачалоПериодаПланирования = РезультатВыбора.НачалоПериода;
	Объект.КонецПериодаПланирования  = РезультатВыбора.КонецПериода;
	Объект.ВидПериода = РезультатВыбора.ПериодичностьКонтроля;
	Объект.ПредставлениеПериодаПланирования = РезультатВыбора.ПредставлениеПериода;
	ДоступностьПериодадляУстановкиПоказателя();
	
КонецПроцедуры

&НаСервере
Функция ДоступностьПериодаДляУстановкиПоказателя(Предупреждение = Неопределено)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	CRM_ИспользуемыеКлючевыеПоказатели.Регистратор
	                      |ИЗ
	                      |	РегистрСведений.CRM_ИспользуемыеКлючевыеПоказатели КАК CRM_ИспользуемыеКлючевыеПоказатели
	                      |ГДЕ
	                      |	CRM_ИспользуемыеКлючевыеПоказатели.Показатель = &Показатель
	                      |	И CRM_ИспользуемыеКлючевыеПоказатели.Менеджер = &Менеджер
	                      |	И CRM_ИспользуемыеКлючевыеПоказатели.Регистратор <> &Регистратор
	                      |	И CRM_ИспользуемыеКлючевыеПоказатели.Период >= &НачалоПериода И CRM_ИспользуемыеКлючевыеПоказатели.Период <= &КонецПериода");
						  
	Запрос.УстановитьПараметр("Менеджер", Объект.Исполнитель);
	Запрос.УстановитьПараметр("Показатель", Объект.Показатель);
	Запрос.УстановитьПараметр("Регистратор", Объект.Ссылка);
	Запрос.УстановитьПараметр("НачалоПериода", Объект.НачалоПериодаПланирования);
	Запрос.УстановитьПараметр("КонецПериода", Объект.КонецПериодаПланирования);
	
	Если Запрос.Выполнить().Пустой() Тогда
		Элементы.ДекорацияНадписьДоступностьПоказателя.ЦветТекста = WebЦвета.ЦветМорскойВолны;
		Элементы.ДекорацияНадписьДоступностьПоказателя.Заголовок = ""; //НСтр("ru = 'В выбранном периоде показатель не назначен.'");
		Возврат Истина;
	Иначе
		Элементы.ДекорацияНадписьДоступностьПоказателя.ЦветТекста = WebЦвета.Кирпичный;
		Предупреждение = НСтр("ru = 'В выбранном периоде показатель уже назначен!'");
		Элементы.ДекорацияНадписьДоступностьПоказателя.Заголовок = Предупреждение;
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ИсполнительПриИзменении(Элемент)
	УстановитьЗаголовокФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПоказательПриИзменении(Элемент)
	УстановитьЗаголовокФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Предупреждение = "";
	Если НЕ ДоступностьПериодадляУстановкиПоказателя(Предупреждение) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Предупреждение,, "ПредставлениеПериодаПланирования", "ПредставлениеПериодаПланирования");
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	CRM_СобытияФормКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	CRM_СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	CRM_СобытияФорм.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	CRM_СобытияФорм.ПередЗаписьюНаСервере(ЭтотОбъект, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

#КонецОбласти
